# Використовуємо офіційний, легкий образ Python
FROM python:3.8-slim

# Встановлюємо ENV змінні, щоб Python виводив все одразу в лог
ENV PYTHONUNBUFFERED 1

# Встановлюємо робочу директорію всередині контейнера
WORKDIR /app
# Зміна для скидання кешу v1

# Копіюємо файл з залежностями
COPY requirements.txt .

# Встановлюємо залежності проекту
RUN pip install --no-cache-dir -r requirements.txt

# Копіюємо решту коду додатку в робочу директорію
COPY . .

# Команда, яка буде виконана при запуску контейнера
CMD ["python", "bot.py"]